#!/usr/bin/python3.6
# -*- coding: utf-8 -*-
'''
Задание 15.2

Создать функцию return_match, которая ожидает два аргумента:
* имя файла, в котором находится вывод команды show
* регулярное выражение

Функция должна обрабатывать вывод команды show построчно и возвращать список подстрок,
которые совпали с регулярным выражением (не всю строку, где было найдено совпадение,
а только ту подстроку, которая совпала с выражением).

Проверить работу функции на примере вывода команды sh ip int br (файл sh_ip_int_br.txt).
Вывести список всех IP-адресов из вывода команды.

Соответственно, регулярное выражение должно описывать подстроку с IP-адресом (то есть, совпадением должен быть IP-адрес).


Обратите внимание, что в данном случае, можно не проверять корректность IP-адреса,
диапазоны адресов и так далее, так как обрабатывается вывод команды, а не ввод пользователя.

'''

import re


def return_match(file_to_open,regex):
	'''
	eturn_match,ожидает два аргумента:
	* имя файла, в котором находится вывод команды show
	* регулярное выражение

	Функция должна обрабатывать вывод команды show построчно и возвращать список подстрок,
	которые совпали с регулярным выражением/
	'''
	
	result = []
	with open(file_to_open) as f:
		for line in f:
			match = re.search(regex,line)
			if match:
				result.append(match[1])
	
	return result
	
	
	
	

if __name__ == "__main__":
	regex = "\S+\s+([0-9]+\.[0-9]+\.[0-9]+\.[0-9]+).+"
	res_list = return_match('sh_ip_int_br.txt',regex)
	print(res_list)
